grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
/** MDMA_GISR0_GIF15 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF15		(1 << 15)
/** MDMA_GISR0_GIF14 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF14		(1 << 14)
/** MDMA_GISR0_GIF13 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF13		(1 << 13)
/** MDMA_GISR0_GIF12 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF12		(1 << 12)
/** MDMA_GISR0_GIF11 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF11		(1 << 11)
/** MDMA_GISR0_GIF10 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF10		(1 << 10)
/** MDMA_GISR0_GIF9 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF9		(1 << 9)
/** MDMA_GISR0_GIF8 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF8		(1 << 8)
/** MDMA_GISR0_GIF7 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF7		(1 << 7)
/** MDMA_GISR0_GIF6 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF6		(1 << 6)
/** MDMA_GISR0_GIF5 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF5		(1 << 5)
/** MDMA_GISR0_GIF4 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF4		(1 << 4)
/** MDMA_GISR0_GIF3 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF3		(1 << 3)
/** MDMA_GISR0_GIF2 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF2		(1 << 2)
/** MDMA_GISR0_GIF1 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF1		(1 << 1)
/** MDMA_GISR0_GIF0 Channel x global interrupt flag (x=...) This bit is set and reset by hardware. It is a logical OR of all the Channel x interrupt flags (CTCIFx, BTIFx, BRTIFx, TEIFx) which are enabled in the interrupt mask register (CTCIEx, BTIEx, BRTIEx, TEIEx) **/
#define MDMA_GISR0_GIF0		(1 << 0)

/**@}*/

/** @defgroup mdma_c0isr C0ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C0ISR_CRQA0 channel x request active flag **/
#define MDMA_C0ISR_CRQA0		(1 << 16)
/** MDMA_C0ISR_TCIF0 channel x buffer transfer complete **/
#define MDMA_C0ISR_TCIF0		(1 << 4)
/** MDMA_C0ISR_BTIF0 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C0ISR_BTIF0		(1 << 3)
/** MDMA_C0ISR_BRTIF0 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C0ISR_BRTIF0		(1 << 2)
/** MDMA_C0ISR_CTCIF0 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C0ISR_CTCIF0		(1 << 1)
/** MDMA_C0ISR_TEIF0 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C0ISR_TEIF0		(1 << 0)

/**@}*/

/** @defgroup mdma_c0ifcr C0IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C0IFCR_CLTCIF0 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C0IFCR_CLTCIF0		(1 << 4)
/** MDMA_C0IFCR_CBTIF0 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C0IFCR_CBTIF0		(1 << 3)
/** MDMA_C0IFCR_CBRTIF0 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C0IFCR_CBRTIF0		(1 << 2)
/** MDMA_C0IFCR_CCTCIF0 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C0IFCR_CCTCIF0		(1 << 1)
/** MDMA_C0IFCR_CTEIF0 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C0IFCR_CTEIF0		(1 << 0)

/**@}*/

