grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
#define MDMA_C0TCR_SINC_SHIFT		0
#define MDMA_C0TCR_SINC_MASK		0x03
/** @defgroup mdma_c0tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0bndtr C0BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_C0BNDTR_BRC_SHIFT		20
#define MDMA_C0BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_c0bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C0BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C0BNDTR_BRDUM		(1 << 19)
/** MDMA_C0BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C0BNDTR_BRSUM		(1 << 18)

#define MDMA_C0BNDTR_BNDT_SHIFT		0
#define MDMA_C0BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c0bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0sar C0SAR MDMA channel x source address register
@{*/


#define MDMA_C0SAR_SAR_SHIFT		0
#define MDMA_C0SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c0sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0dar C0DAR MDMA channel x destination address register
@{*/


#define MDMA_C0DAR_DAR_SHIFT		0
#define MDMA_C0DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c0dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0brur C0BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_C0BRUR_DUV_SHIFT		16
#define MDMA_C0BRUR_DUV_MASK		0xffff
/** @defgroup mdma_c0brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_C0BRUR_SUV_SHIFT		0
#define MDMA_C0BRUR_SUV_MASK		0xffff
/** @defgroup mdma_c0brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0lar C0LAR MDMA channel x Link Address register
@{*/


#define MDMA_C0LAR_LAR_SHIFT		0
#define MDMA_C0LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_c0lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0tbr C0TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_C0TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_C0TBR_DBUS		(1 << 17)
/** MDMA_C0TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_C0TBR_SBUS		(1 << 16)

#define MDMA_C0TBR_TSEL_SHIFT		0
#define MDMA_C0TBR_TSEL_MASK		0x3f
/** @defgroup mdma_c0tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0mar C0MAR MDMA channel x Mask address register
@{*/


#define MDMA_C0MAR_MAR_SHIFT		0
#define MDMA_C0MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c0mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c0mdr C0MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C0MDR_MDR_SHIFT		0
#define MDMA_C0MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c0mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1isr C1ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C1ISR_CRQA1 channel x request active flag **/
#define MDMA_C1ISR_CRQA1		(1 << 16)
/** MDMA_C1ISR_TCIF1 channel x buffer transfer complete **/
#define MDMA_C1ISR_TCIF1		(1 << 4)
/** MDMA_C1ISR_BTIF1 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C1ISR_BTIF1		(1 << 3)
/** MDMA_C1ISR_BRTIF1 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C1ISR_BRTIF1		(1 << 2)
/** MDMA_C1ISR_CTCIF1 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C1ISR_CTCIF1		(1 << 1)
/** MDMA_C1ISR_TEIF1 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C1ISR_TEIF1		(1 << 0)

/**@}*/

/** @defgroup mdma_c1ifcr C1IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C1IFCR_CLTCIF1 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C1IFCR_CLTCIF1		(1 << 4)
/** MDMA_C1IFCR_CBTIF1 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C1IFCR_CBTIF1		(1 << 3)
/** MDMA_C1IFCR_CBRTIF1 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C1IFCR_CBRTIF1		(1 << 2)
/** MDMA_C1IFCR_CCTCIF1 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C1IFCR_CCTCIF1		(1 << 1)
/** MDMA_C1IFCR_CTEIF1 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C1IFCR_CTEIF1		(1 << 0)

/**@}*/

