grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
#define MDMA_C1TCR_DINCOS_SHIFT		10
#define MDMA_C1TCR_DINCOS_MASK		0x03
/** @defgroup mdma_c1tcr_dincos DINCOS Destination increment offset
@{*/
/**@}*/


#define MDMA_C1TCR_SINCOS_SHIFT		8
#define MDMA_C1TCR_SINCOS_MASK		0x03
/** @defgroup mdma_c1tcr_sincos SINCOS source increment offset size
@{*/
/**@}*/


#define MDMA_C1TCR_DSIZE_SHIFT		6
#define MDMA_C1TCR_DSIZE_MASK		0x03
/** @defgroup mdma_c1tcr_dsize DSIZE Destination data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0. Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If DINCOS &lt; DSIZE and DINC &#8800; 00, the result will be unpredictable. Note: DSIZE = 11 (double-word) is forbidden when destination is TCM/AHB bus (DBUS=1).
@{*/
/**@}*/


#define MDMA_C1TCR_SSIZE_SHIFT		4
#define MDMA_C1TCR_SSIZE_MASK		0x03
/** @defgroup mdma_c1tcr_ssize SSIZE Source data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If SINCOS &lt; SSIZE and SINC &#8800; 00, the result will be unpredictable. Note: SSIZE = 11 (double-word) is forbidden when source is TCM/AHB bus (SBUS=1).
@{*/
/**@}*/


#define MDMA_C1TCR_DINC_SHIFT		2
#define MDMA_C1TCR_DINC_MASK		0x03
/** @defgroup mdma_c1tcr_dinc DINC Destination increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When destination is AHB (DBUS=1), DINC = 00 is forbidden.
@{*/
/**@}*/


#define MDMA_C1TCR_SINC_SHIFT		0
#define MDMA_C1TCR_SINC_MASK		0x03
/** @defgroup mdma_c1tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1bndtr C1BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_C1BNDTR_BRC_SHIFT		20
#define MDMA_C1BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_c1bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C1BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C1BNDTR_BRDUM		(1 << 19)
/** MDMA_C1BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C1BNDTR_BRSUM		(1 << 18)

#define MDMA_C1BNDTR_BNDT_SHIFT		0
#define MDMA_C1BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c1bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1sar C1SAR MDMA channel x source address register
@{*/


#define MDMA_C1SAR_SAR_SHIFT		0
#define MDMA_C1SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c1sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1dar C1DAR MDMA channel x destination address register
@{*/


#define MDMA_C1DAR_DAR_SHIFT		0
#define MDMA_C1DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c1dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1brur C1BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_C1BRUR_DUV_SHIFT		16
#define MDMA_C1BRUR_DUV_MASK		0xffff
/** @defgroup mdma_c1brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_C1BRUR_SUV_SHIFT		0
#define MDMA_C1BRUR_SUV_MASK		0xffff
/** @defgroup mdma_c1brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1lar C1LAR MDMA channel x Link Address register
@{*/


#define MDMA_C1LAR_LAR_SHIFT		0
#define MDMA_C1LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_c1lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1tbr C1TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_C1TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_C1TBR_DBUS		(1 << 17)
/** MDMA_C1TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_C1TBR_SBUS		(1 << 16)

#define MDMA_C1TBR_TSEL_SHIFT		0
#define MDMA_C1TBR_TSEL_MASK		0x3f
/** @defgroup mdma_c1tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1mar C1MAR MDMA channel x Mask address register
@{*/


#define MDMA_C1MAR_MAR_SHIFT		0
#define MDMA_C1MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c1mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c1mdr C1MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C1MDR_MDR_SHIFT		0
#define MDMA_C1MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c1mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c2isr C2ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C2ISR_CRQA2 channel x request active flag **/
#define MDMA_C2ISR_CRQA2		(1 << 16)
/** MDMA_C2ISR_TCIF2 channel x buffer transfer complete **/
#define MDMA_C2ISR_TCIF2		(1 << 4)
/** MDMA_C2ISR_BTIF2 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C2ISR_BTIF2		(1 << 3)
/** MDMA_C2ISR_BRTIF2 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C2ISR_BRTIF2		(1 << 2)
/** MDMA_C2ISR_CTCIF2 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C2ISR_CTCIF2		(1 << 1)
/** MDMA_C2ISR_TEIF2 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C2ISR_TEIF2		(1 << 0)

/**@}*/

/** @defgroup mdma_c2ifcr C2IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C2IFCR_CLTCIF2 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C2IFCR_CLTCIF2		(1 << 4)
/** MDMA_C2IFCR_CBTIF2 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C2IFCR_CBTIF2		(1 << 3)
/** MDMA_C2IFCR_CBRTIF2 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C2IFCR_CBRTIF2		(1 << 2)
/** MDMA_C2IFCR_CCTCIF2 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C2IFCR_CCTCIF2		(1 << 1)
/** MDMA_C2IFCR_CTEIF2 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C2IFCR_CTEIF2		(1 << 0)

/**@}*/

/** @defgroup mdma_c2esr C2ESR MDMA Channel x error status register
@{*/

