grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
#define MDMA_C5MAR_MAR_SHIFT		0
#define MDMA_C5MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c5mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c5mdr C5MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C5MDR_MDR_SHIFT		0
#define MDMA_C5MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c5mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6isr C6ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C6ISR_CRQA6 channel x request active flag **/
#define MDMA_C6ISR_CRQA6		(1 << 16)
/** MDMA_C6ISR_TCIF6 channel x buffer transfer complete **/
#define MDMA_C6ISR_TCIF6		(1 << 4)
/** MDMA_C6ISR_BTIF6 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C6ISR_BTIF6		(1 << 3)
/** MDMA_C6ISR_BRTIF6 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C6ISR_BRTIF6		(1 << 2)
/** MDMA_C6ISR_CTCIF6 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C6ISR_CTCIF6		(1 << 1)
/** MDMA_C6ISR_TEIF6 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C6ISR_TEIF6		(1 << 0)

/**@}*/

/** @defgroup mdma_c6ifcr C6IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C6IFCR_CLTCIF6 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C6IFCR_CLTCIF6		(1 << 4)
/** MDMA_C6IFCR_CBTIF6 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C6IFCR_CBTIF6		(1 << 3)
/** MDMA_C6IFCR_CBRTIF6 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C6IFCR_CBRTIF6		(1 << 2)
/** MDMA_C6IFCR_CCTCIF6 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C6IFCR_CCTCIF6		(1 << 1)
/** MDMA_C6IFCR_CTEIF6 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C6IFCR_CTEIF6		(1 << 0)

/**@}*/

/** @defgroup mdma_c6esr C6ESR MDMA Channel x error status register
@{*/

/** MDMA_C6ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C6ESR_BSE		(1 << 11)
/** MDMA_C6ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C6ESR_ASE		(1 << 10)
/** MDMA_C6ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C6ESR_TEMD		(1 << 9)
/** MDMA_C6ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C6ESR_TELD		(1 << 8)
/** MDMA_C6ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_C6ESR_TED		(1 << 7)

#define MDMA_C6ESR_TEA_SHIFT		0
#define MDMA_C6ESR_TEA_MASK		0x7f
/** @defgroup mdma_c6esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6cr C6CR This register is used to control the concerned channel.
@{*/

/** MDMA_C6CR_SWRQ SW ReQuest Writing a 1 into this bit sets the CRQAx in MDMA_ISRy register, activating the request on Channel x Note: Either the whole CxCR register or the 8-bit/16-bit register @ Address offset: 0x4E + 0x40 chn may be used for SWRQ activation. In case of a SW request, acknowledge is not generated (neither HW signal, nor CxMAR write access). **/
#define MDMA_C6CR_SWRQ		(1 << 16)
/** MDMA_C6CR_WEX Word Endianness exchange **/
#define MDMA_C6CR_WEX		(1 << 14)
/** MDMA_C6CR_HEX Half word Endianes exchange **/
#define MDMA_C6CR_HEX		(1 << 13)
/** MDMA_C6CR_BEX byte Endianness exchange **/
#define MDMA_C6CR_BEX		(1 << 12)

#define MDMA_C6CR_PL_SHIFT		6
#define MDMA_C6CR_PL_MASK		0x03
/** @defgroup mdma_c6cr_pl PL Priority level These bits are set and cleared by software. These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C6CR_TCIE buffer Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_C6CR_TCIE		(1 << 5)
/** MDMA_C6CR_BTIE Block Transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_C6CR_BTIE		(1 << 4)
/** MDMA_C6CR_BRTIE Block Repeat transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_C6CR_BRTIE		(1 << 3)
/** MDMA_C6CR_CTCIE Channel Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_C6CR_CTCIE		(1 << 2)
/** MDMA_C6CR_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define MDMA_C6CR_TEIE		(1 << 1)
/** MDMA_C6CR_EN channel enable **/
#define MDMA_C6CR_EN		(1 << 0)

/**@}*/

