grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
/** @defgroup mdma_c6tcr C6TCR This register is used to configure the concerned channel.
@{*/

/** MDMA_C6TCR_BWM Bufferable Write Mode This bit is set and cleared by software. This bit is protected and can be written only if EN is 0. Note: All MDMA destination accesses are non-cacheable. **/
#define MDMA_C6TCR_BWM		(1 << 31)
/** MDMA_C6TCR_SWRM SW Request Mode This bit is set and cleared by software. If a HW or SW request is currently active, the bit change will be delayed until the current transfer is completed. If the CxMAR contains a valid address, the CxMDR value will also be written @ CxMAR address. This bit is protected and can be written only if EN is 0. **/
#define MDMA_C6TCR_SWRM		(1 << 30)

#define MDMA_C6TCR_TRGM_SHIFT		28
#define MDMA_C6TCR_TRGM_MASK		0x03
/** @defgroup mdma_c6tcr_trgm TRGM Trigger Mode These bits are set and cleared by software. Note: If TRGM is 11 for the current block, all the values loaded at the end of the current block through the linked list mechanism must keep the same value (TRGM=11) and the same SWRM value, otherwise the result is undefined. These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/


#define MDMA_C6TCR_PAM_SHIFT		26
#define MDMA_C6TCR_PAM_MASK		0x03
/** @defgroup mdma_c6tcr_pam PAM Padding/Alignement Mode These bits are set and cleared by software. Case 1: Source data size smaller than destination data size - 3 options are valid. Case 2: Source data size larger than destination data size. The remainder part is discarded. When PKE = 1 or DSIZE=SSIZE, these bits are ignored. These bits are protected and can be written only if EN is 0
@{*/
/**@}*/

/** MDMA_C6TCR_PKE PacK Enable These bit is set and cleared by software. If the Source Size is smaller than the destination, it will be padded according to the PAM value. If the Source data size is larger than the destination one, it will be truncated. The alignment will be done according to the PAM[0] value. This bit is protected and can be written only if EN is 0 **/
#define MDMA_C6TCR_PKE		(1 << 25)

#define MDMA_C6TCR_TLEN_SHIFT		18
#define MDMA_C6TCR_TLEN_MASK		0x7f
/** @defgroup mdma_c6tcr_tlen TLEN buffer transfer lengh
@{*/
/**@}*/


#define MDMA_C6TCR_DBURST_SHIFT		15
#define MDMA_C6TCR_DBURST_MASK		0x07
/** @defgroup mdma_c6tcr_dburst DBURST Destination burst transfer configuration
@{*/
/**@}*/


#define MDMA_C6TCR_SBURST_SHIFT		12
#define MDMA_C6TCR_SBURST_MASK		0x07
/** @defgroup mdma_c6tcr_sburst SBURST source burst transfer configuration
@{*/
/**@}*/


#define MDMA_C6TCR_DINCOS_SHIFT		10
#define MDMA_C6TCR_DINCOS_MASK		0x03
/** @defgroup mdma_c6tcr_dincos DINCOS Destination increment offset
@{*/
/**@}*/


#define MDMA_C6TCR_SINCOS_SHIFT		8
#define MDMA_C6TCR_SINCOS_MASK		0x03
/** @defgroup mdma_c6tcr_sincos SINCOS source increment offset size
@{*/
/**@}*/


#define MDMA_C6TCR_DSIZE_SHIFT		6
#define MDMA_C6TCR_DSIZE_MASK		0x03
/** @defgroup mdma_c6tcr_dsize DSIZE Destination data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0. Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If DINCOS &lt; DSIZE and DINC &#8800; 00, the result will be unpredictable. Note: DSIZE = 11 (double-word) is forbidden when destination is TCM/AHB bus (DBUS=1).
@{*/
/**@}*/


#define MDMA_C6TCR_SSIZE_SHIFT		4
#define MDMA_C6TCR_SSIZE_MASK		0x03
/** @defgroup mdma_c6tcr_ssize SSIZE Source data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If SINCOS &lt; SSIZE and SINC &#8800; 00, the result will be unpredictable. Note: SSIZE = 11 (double-word) is forbidden when source is TCM/AHB bus (SBUS=1).
@{*/
/**@}*/


#define MDMA_C6TCR_DINC_SHIFT		2
#define MDMA_C6TCR_DINC_MASK		0x03
/** @defgroup mdma_c6tcr_dinc DINC Destination increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When destination is AHB (DBUS=1), DINC = 00 is forbidden.
@{*/
/**@}*/


#define MDMA_C6TCR_SINC_SHIFT		0
#define MDMA_C6TCR_SINC_MASK		0x03
/** @defgroup mdma_c6tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6bndtr C6BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_C6BNDTR_BRC_SHIFT		20
#define MDMA_C6BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_c6bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0
@{*/
/**@}*/

/** MDMA_C6BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C6BNDTR_BRDUM		(1 << 19)
/** MDMA_C6BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C6BNDTR_BRSUM		(1 << 18)

#define MDMA_C6BNDTR_BNDT_SHIFT		0
#define MDMA_C6BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c6bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6sar C6SAR MDMA channel x source address register
@{*/


#define MDMA_C6SAR_SAR_SHIFT		0
#define MDMA_C6SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c6sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6dar C6DAR MDMA channel x destination address register
@{*/


#define MDMA_C6DAR_DAR_SHIFT		0
#define MDMA_C6DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c6dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6brur C6BRUR MDMA channel x Block Repeat address Update register
@{*/


