grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
#define MDMA_C6BRUR_DUV_SHIFT		16
#define MDMA_C6BRUR_DUV_MASK		0xffff
/** @defgroup mdma_c6brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_C6BRUR_SUV_SHIFT		0
#define MDMA_C6BRUR_SUV_MASK		0xffff
/** @defgroup mdma_c6brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6lar C6LAR MDMA channel x Link Address register
@{*/


#define MDMA_C6LAR_LAR_SHIFT		0
#define MDMA_C6LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_c6lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6tbr C6TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_C6TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_C6TBR_DBUS		(1 << 17)
/** MDMA_C6TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_C6TBR_SBUS		(1 << 16)

#define MDMA_C6TBR_TSEL_SHIFT		0
#define MDMA_C6TBR_TSEL_MASK		0x3f
/** @defgroup mdma_c6tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6mar C6MAR MDMA channel x Mask address register
@{*/


#define MDMA_C6MAR_MAR_SHIFT		0
#define MDMA_C6MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c6mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c6mdr C6MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C6MDR_MDR_SHIFT		0
#define MDMA_C6MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c6mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c7isr C7ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C7ISR_CRQA7 channel x request active flag **/
#define MDMA_C7ISR_CRQA7		(1 << 16)
/** MDMA_C7ISR_TCIF7 channel x buffer transfer complete **/
#define MDMA_C7ISR_TCIF7		(1 << 4)
/** MDMA_C7ISR_BTIF7 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C7ISR_BTIF7		(1 << 3)
/** MDMA_C7ISR_BRTIF7 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C7ISR_BRTIF7		(1 << 2)
/** MDMA_C7ISR_CTCIF7 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C7ISR_CTCIF7		(1 << 1)
/** MDMA_C7ISR_TEIF7 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C7ISR_TEIF7		(1 << 0)

/**@}*/

/** @defgroup mdma_c7ifcr C7IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C7IFCR_CLTCIF7 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C7IFCR_CLTCIF7		(1 << 4)
/** MDMA_C7IFCR_CBTIF7 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C7IFCR_CBTIF7		(1 << 3)
/** MDMA_C7IFCR_CBRTIF7 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C7IFCR_CBRTIF7		(1 << 2)
/** MDMA_C7IFCR_CCTCIF7 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C7IFCR_CCTCIF7		(1 << 1)
/** MDMA_C7IFCR_CTEIF7 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C7IFCR_CTEIF7		(1 << 0)

/**@}*/

/** @defgroup mdma_c7esr C7ESR MDMA Channel x error status register
@{*/

/** MDMA_C7ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C7ESR_BSE		(1 << 11)
/** MDMA_C7ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C7ESR_ASE		(1 << 10)
/** MDMA_C7ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C7ESR_TEMD		(1 << 9)
/** MDMA_C7ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C7ESR_TELD		(1 << 8)
/** MDMA_C7ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_C7ESR_TED		(1 << 7)

#define MDMA_C7ESR_TEA_SHIFT		0
#define MDMA_C7ESR_TEA_MASK		0x7f
/** @defgroup mdma_c7esr_tea TEA Transfer Error Address These bits are set and cleared by HW, in case of an MDMA data transfer error. It is used in conjunction with TED. This field indicates the 7 LSBits of the address which generated a transfer/access error. It may be used by SW to retrieve the failing address, by adding this value (truncated to the buffer transfer length size) to the current SAR/DAR value. Note: The SAR/DAR current value doesnt reflect this last address due to the FIFO management system. The SAR/DAR are only updated at the end of a (buffer) transfer (of TLEN+1 bytes). Note: It is not set in case of a link data error.
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c7cr C7CR This register is used to control the concerned channel.
@{*/

