grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
/** @defgroup mdma_c8cr C8CR This register is used to control the concerned channel.
@{*/

/** MDMA_C8CR_SWRQ SW ReQuest Writing a 1 into this bit sets the CRQAx in MDMA_ISRy register, activating the request on Channel x Note: Either the whole CxCR register or the 8-bit/16-bit register @ Address offset: 0x4E + 0x40 chn may be used for SWRQ activation. In case of a SW request, acknowledge is not generated (neither HW signal, nor CxMAR write access). **/
#define MDMA_C8CR_SWRQ		(1 << 16)
/** MDMA_C8CR_WEX Word Endianness exchange **/
#define MDMA_C8CR_WEX		(1 << 14)
/** MDMA_C8CR_HEX Half word Endianes exchange **/
#define MDMA_C8CR_HEX		(1 << 13)
/** MDMA_C8CR_BEX byte Endianness exchange **/
#define MDMA_C8CR_BEX		(1 << 12)

#define MDMA_C8CR_PL_SHIFT		6
#define MDMA_C8CR_PL_MASK		0x03
/** @defgroup mdma_c8cr_pl PL Priority level These bits are set and cleared by software. These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C8CR_TCIE buffer Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_C8CR_TCIE		(1 << 5)
/** MDMA_C8CR_BTIE Block Transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_C8CR_BTIE		(1 << 4)
/** MDMA_C8CR_BRTIE Block Repeat transfer interrupt enable This bit is set and cleared by software. **/
#define MDMA_C8CR_BRTIE		(1 << 3)
/** MDMA_C8CR_CTCIE Channel Transfer Complete interrupt enable This bit is set and cleared by software. **/
#define MDMA_C8CR_CTCIE		(1 << 2)
/** MDMA_C8CR_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define MDMA_C8CR_TEIE		(1 << 1)
/** MDMA_C8CR_EN channel enable **/
#define MDMA_C8CR_EN		(1 << 0)

/**@}*/

/** @defgroup mdma_c8tcr C8TCR This register is used to configure the concerned channel.
@{*/

/** MDMA_C8TCR_BWM Bufferable Write Mode This bit is set and cleared by software. This bit is protected and can be written only if EN is 0. Note: All MDMA destination accesses are non-cacheable. **/
#define MDMA_C8TCR_BWM		(1 << 31)
/** MDMA_C8TCR_SWRM SW Request Mode This bit is set and cleared by software. If a HW or SW request is currently active, the bit change will be delayed until the current transfer is completed. If the CxMAR contains a valid address, the CxMDR value will also be written @ CxMAR address. This bit is protected and can be written only if EN is 0. **/
#define MDMA_C8TCR_SWRM		(1 << 30)

#define MDMA_C8TCR_TRGM_SHIFT		28
#define MDMA_C8TCR_TRGM_MASK		0x03
/** @defgroup mdma_c8tcr_trgm TRGM Trigger Mode These bits are set and cleared by software. Note: If TRGM is 11 for the current block, all the values loaded at the end of the current block through the linked list mechanism must keep the same value (TRGM=11) and the same SWRM value, otherwise the result is undefined. These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/


#define MDMA_C8TCR_PAM_SHIFT		26
#define MDMA_C8TCR_PAM_MASK		0x03
/** @defgroup mdma_c8tcr_pam PAM Padding/Alignement Mode These bits are set and cleared by software. Case 1: Source data size smaller than destination data size - 3 options are valid. Case 2: Source data size larger than destination data size. The remainder part is discarded. When PKE = 1 or DSIZE=SSIZE, these bits are ignored. These bits are protected and can be written only if EN is 0
@{*/
/**@}*/

/** MDMA_C8TCR_PKE PacK Enable These bit is set and cleared by software. If the Source Size is smaller than the destination, it will be padded according to the PAM value. If the Source data size is larger than the destination one, it will be truncated. The alignment will be done according to the PAM[0] value. This bit is protected and can be written only if EN is 0 **/
#define MDMA_C8TCR_PKE		(1 << 25)

#define MDMA_C8TCR_TLEN_SHIFT		18
#define MDMA_C8TCR_TLEN_MASK		0x7f
/** @defgroup mdma_c8tcr_tlen TLEN buffer transfer lengh
@{*/
/**@}*/


#define MDMA_C8TCR_DBURST_SHIFT		15
#define MDMA_C8TCR_DBURST_MASK		0x07
/** @defgroup mdma_c8tcr_dburst DBURST Destination burst transfer configuration
@{*/
/**@}*/


#define MDMA_C8TCR_SBURST_SHIFT		12
#define MDMA_C8TCR_SBURST_MASK		0x07
/** @defgroup mdma_c8tcr_sburst SBURST source burst transfer configuration
@{*/
/**@}*/


#define MDMA_C8TCR_DINCOS_SHIFT		10
#define MDMA_C8TCR_DINCOS_MASK		0x03
/** @defgroup mdma_c8tcr_dincos DINCOS Destination increment offset
@{*/
/**@}*/


#define MDMA_C8TCR_SINCOS_SHIFT		8
#define MDMA_C8TCR_SINCOS_MASK		0x03
/** @defgroup mdma_c8tcr_sincos SINCOS source increment offset size
@{*/
/**@}*/


#define MDMA_C8TCR_DSIZE_SHIFT		6
#define MDMA_C8TCR_DSIZE_MASK		0x03
/** @defgroup mdma_c8tcr_dsize DSIZE Destination data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0. Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If DINCOS &lt; DSIZE and DINC &#8800; 00, the result will be unpredictable. Note: DSIZE = 11 (double-word) is forbidden when destination is TCM/AHB bus (DBUS=1).
@{*/
/**@}*/


#define MDMA_C8TCR_SSIZE_SHIFT		4
#define MDMA_C8TCR_SSIZE_MASK		0x03
/** @defgroup mdma_c8tcr_ssize SSIZE Source data size These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: If a value of 11 is programmed for the TCM access/AHB port, a transfer error will occur (TEIF bit set) If SINCOS &lt; SSIZE and SINC &#8800; 00, the result will be unpredictable. Note: SSIZE = 11 (double-word) is forbidden when source is TCM/AHB bus (SBUS=1).
@{*/
/**@}*/


#define MDMA_C8TCR_DINC_SHIFT		2
#define MDMA_C8TCR_DINC_MASK		0x03
/** @defgroup mdma_c8tcr_dinc DINC Destination increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When destination is AHB (DBUS=1), DINC = 00 is forbidden.
@{*/
/**@}*/


#define MDMA_C8TCR_SINC_SHIFT		0
#define MDMA_C8TCR_SINC_MASK		0x03
/** @defgroup mdma_c8tcr_sinc SINC Source increment mode These bits are set and cleared by software. These bits are protected and can be written only if EN is 0 Note: When source is AHB (SBUS=1), SINC = 00 is forbidden. In Linked List Mode, at the end of a block (single or last block in repeated block transfer mode), this register will be loaded from memory (from address given by current LAR[31:0] + 0x00).
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c8bndtr C8BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_C8BNDTR_BRC_SHIFT		20
#define MDMA_C8BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_c8bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C8BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C8BNDTR_BRDUM		(1 << 19)
/** MDMA_C8BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C8BNDTR_BRSUM		(1 << 18)

#define MDMA_C8BNDTR_BNDT_SHIFT		0
#define MDMA_C8BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c8bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c8sar C8SAR MDMA channel x source address register
@{*/


#define MDMA_C8SAR_SAR_SHIFT		0
#define MDMA_C8SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c8sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c8dar C8DAR MDMA channel x destination address register
@{*/


#define MDMA_C8DAR_DAR_SHIFT		0
#define MDMA_C8DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c8dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

