grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
/** MDMA_C10BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C10BNDTR_BRDUM		(1 << 19)
/** MDMA_C10BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C10BNDTR_BRSUM		(1 << 18)

#define MDMA_C10BNDTR_BNDT_SHIFT		0
#define MDMA_C10BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c10bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10sar C10SAR MDMA channel x source address register
@{*/


#define MDMA_C10SAR_SAR_SHIFT		0
#define MDMA_C10SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c10sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10dar C10DAR MDMA channel x destination address register
@{*/


#define MDMA_C10DAR_DAR_SHIFT		0
#define MDMA_C10DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c10dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10brur C10BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_C10BRUR_DUV_SHIFT		16
#define MDMA_C10BRUR_DUV_MASK		0xffff
/** @defgroup mdma_c10brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_C10BRUR_SUV_SHIFT		0
#define MDMA_C10BRUR_SUV_MASK		0xffff
/** @defgroup mdma_c10brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10lar C10LAR MDMA channel x Link Address register
@{*/


#define MDMA_C10LAR_LAR_SHIFT		0
#define MDMA_C10LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_c10lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10tbr C10TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_C10TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_C10TBR_DBUS		(1 << 17)
/** MDMA_C10TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_C10TBR_SBUS		(1 << 16)

#define MDMA_C10TBR_TSEL_SHIFT		0
#define MDMA_C10TBR_TSEL_MASK		0x3f
/** @defgroup mdma_c10tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10mar C10MAR MDMA channel x Mask address register
@{*/


#define MDMA_C10MAR_MAR_SHIFT		0
#define MDMA_C10MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c10mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c10mdr C10MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C10MDR_MDR_SHIFT		0
#define MDMA_C10MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c10mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c11isr C11ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C11ISR_CRQA11 channel x request active flag **/
#define MDMA_C11ISR_CRQA11		(1 << 16)
/** MDMA_C11ISR_TCIF11 channel x buffer transfer complete **/
#define MDMA_C11ISR_TCIF11		(1 << 4)
/** MDMA_C11ISR_BTIF11 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C11ISR_BTIF11		(1 << 3)
/** MDMA_C11ISR_BRTIF11 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C11ISR_BRTIF11		(1 << 2)
/** MDMA_C11ISR_CTCIF11 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C11ISR_CTCIF11		(1 << 1)
/** MDMA_C11ISR_TEIF11 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C11ISR_TEIF11		(1 << 0)

/**@}*/

/** @defgroup mdma_c11ifcr C11IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C11IFCR_CLTCIF11 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C11IFCR_CLTCIF11		(1 << 4)
/** MDMA_C11IFCR_CBTIF11 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C11IFCR_CBTIF11		(1 << 3)
/** MDMA_C11IFCR_CBRTIF11 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C11IFCR_CBRTIF11		(1 << 2)
/** MDMA_C11IFCR_CCTCIF11 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C11IFCR_CCTCIF11		(1 << 1)
/** MDMA_C11IFCR_CTEIF11 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C11IFCR_CTEIF11		(1 << 0)

/**@}*/

/** @defgroup mdma_c11esr C11ESR MDMA Channel x error status register
@{*/

/** MDMA_C11ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C11ESR_BSE		(1 << 11)
/** MDMA_C11ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C11ESR_ASE		(1 << 10)
/** MDMA_C11ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C11ESR_TEMD		(1 << 9)
/** MDMA_C11ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C11ESR_TELD		(1 << 8)
/** MDMA_C11ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_C11ESR_TED		(1 << 7)

