grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
/** @defgroup mdma_c13bndtr C13BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_C13BNDTR_BRC_SHIFT		20
#define MDMA_C13BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_c13bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C13BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C13BNDTR_BRDUM		(1 << 19)
/** MDMA_C13BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C13BNDTR_BRSUM		(1 << 18)

#define MDMA_C13BNDTR_BNDT_SHIFT		0
#define MDMA_C13BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c13bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13sar C13SAR MDMA channel x source address register
@{*/


#define MDMA_C13SAR_SAR_SHIFT		0
#define MDMA_C13SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c13sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13dar C13DAR MDMA channel x destination address register
@{*/


#define MDMA_C13DAR_DAR_SHIFT		0
#define MDMA_C13DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c13dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13brur C13BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_C13BRUR_DUV_SHIFT		16
#define MDMA_C13BRUR_DUV_MASK		0xffff
/** @defgroup mdma_c13brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_C13BRUR_SUV_SHIFT		0
#define MDMA_C13BRUR_SUV_MASK		0xffff
/** @defgroup mdma_c13brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13lar C13LAR MDMA channel x Link Address register
@{*/


#define MDMA_C13LAR_LAR_SHIFT		0
#define MDMA_C13LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_c13lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13tbr C13TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_C13TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_C13TBR_DBUS		(1 << 17)
/** MDMA_C13TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_C13TBR_SBUS		(1 << 16)

#define MDMA_C13TBR_TSEL_SHIFT		0
#define MDMA_C13TBR_TSEL_MASK		0x3f
/** @defgroup mdma_c13tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13mar C13MAR MDMA channel x Mask address register
@{*/


#define MDMA_C13MAR_MAR_SHIFT		0
#define MDMA_C13MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c13mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c13mdr C13MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C13MDR_MDR_SHIFT		0
#define MDMA_C13MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c13mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c14isr C14ISR MDMA channel x interrupt/status register
@{*/

/** MDMA_C14ISR_CRQA14 channel x request active flag **/
#define MDMA_C14ISR_CRQA14		(1 << 16)
/** MDMA_C14ISR_TCIF14 channel x buffer transfer complete **/
#define MDMA_C14ISR_TCIF14		(1 << 4)
/** MDMA_C14ISR_BTIF14 Channel x block transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C14ISR_BTIF14		(1 << 3)
/** MDMA_C14ISR_BRTIF14 Channel x block repeat transfer complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C14ISR_BRTIF14		(1 << 2)
/** MDMA_C14ISR_CTCIF14 Channel x Channel Transfer Complete interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. CTC is set when the last block was transferred and the channel has been automatically disabled. CTC is also set when the channel is suspended, as a result of writing EN bit to 0. **/
#define MDMA_C14ISR_CTCIF14		(1 << 1)
/** MDMA_C14ISR_TEIF14 Channel x transfer error interrupt flag This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCRy register. **/
#define MDMA_C14ISR_TEIF14		(1 << 0)

/**@}*/

/** @defgroup mdma_c14ifcr C14IFCR MDMA channel x interrupt flag clear register
@{*/

/** MDMA_C14IFCR_CLTCIF14 CLear buffer Transfer Complete Interrupt Flag for channel x Writing a 1 into this bit clears TCIFx in the MDMA_ISRy register **/
#define MDMA_C14IFCR_CLTCIF14		(1 << 4)
/** MDMA_C14IFCR_CBTIF14 Channel x Clear block transfer complete interrupt flag Writing a 1 into this bit clears BTIFx in the MDMA_ISRy register **/
#define MDMA_C14IFCR_CBTIF14		(1 << 3)
/** MDMA_C14IFCR_CBRTIF14 Channel x clear block repeat transfer complete interrupt flag Writing a 1 into this bit clears BRTIFx in the MDMA_ISRy register **/
#define MDMA_C14IFCR_CBRTIF14		(1 << 2)
/** MDMA_C14IFCR_CCTCIF14 Clear Channel transfer complete interrupt flag for channel x Writing a 1 into this bit clears CTCIFx in the MDMA_ISRy register **/
#define MDMA_C14IFCR_CCTCIF14		(1 << 1)
/** MDMA_C14IFCR_CTEIF14 Channel x clear transfer error interrupt flag Writing a 1 into this bit clears TEIFx in the MDMA_ISRy register **/
#define MDMA_C14IFCR_CTEIF14		(1 << 0)

/**@}*/

/** @defgroup mdma_c14esr C14ESR MDMA Channel x error status register
@{*/

/** MDMA_C14ESR_BSE Block Size Error These bit is set by HW, when the block size is not an integer multiple of the data size either for source or destination. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C14ESR_BSE		(1 << 11)
/** MDMA_C14ESR_ASE Address/Size Error These bit is set by HW, when the programmed address is not aligned with the data size. TED will indicate whether the problem is on the source or destination. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C14ESR_ASE		(1 << 10)
/** MDMA_C14ESR_TEMD Transfer Error Mask Data These bit is set by HW, in case of a transfer error while writing the Mask Data. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C14ESR_TEMD		(1 << 9)
/** MDMA_C14ESR_TELD Transfer Error Link Data These bit is set by HW, in case of a transfer error while reading the block link data structure. It is cleared by software writing 1 to the CTEIFx bit in the DMA_IFCRy register. **/
#define MDMA_C14ESR_TELD		(1 << 8)
/** MDMA_C14ESR_TED Transfer Error Direction These bit is set and cleared by HW, in case of an MDMA data transfer error. **/
#define MDMA_C14ESR_TED		(1 << 7)

