grevaillot/svd_tools/headers/STM32H7A3x/mdma.h
/** @defgroup mdma_c15bndtr C15BNDTR MDMA Channel x block number of data register
@{*/


#define MDMA_C15BNDTR_BRC_SHIFT		20
#define MDMA_C15BNDTR_BRC_MASK		0xfff
/** @defgroup mdma_c15bndtr_brc BRC Block Repeat Count This field contains the number of repetitions of the current block (0 to 4095). When the channel is enabled, this register is read-only, indicating the remaining number of blocks, excluding the current one. This register decrements after each complete block transfer. Once the last block transfer has completed, this register can either stay at zero or be reloaded automatically from memory (in Linked List mode - i.e. Link Address valid). These bits are protected and can be written only if EN is 0.
@{*/
/**@}*/

/** MDMA_C15BNDTR_BRDUM Block Repeat Destination address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C15BNDTR_BRDUM		(1 << 19)
/** MDMA_C15BNDTR_BRSUM Block Repeat Source address Update Mode These bits are protected and can be written only if EN is 0. **/
#define MDMA_C15BNDTR_BRSUM		(1 << 18)

#define MDMA_C15BNDTR_BNDT_SHIFT		0
#define MDMA_C15BNDTR_BNDT_MASK		0x1ffff
/** @defgroup mdma_c15bndtr_bndt BNDT block number of data to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15sar C15SAR MDMA channel x source address register
@{*/


#define MDMA_C15SAR_SAR_SHIFT		0
#define MDMA_C15SAR_SAR_MASK		0xffffffff
/** @defgroup mdma_c15sar_sar SAR source adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15dar C15DAR MDMA channel x destination address register
@{*/


#define MDMA_C15DAR_DAR_SHIFT		0
#define MDMA_C15DAR_DAR_MASK		0xffffffff
/** @defgroup mdma_c15dar_dar DAR Destination adr base
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15brur C15BRUR MDMA channel x Block Repeat address Update register
@{*/


#define MDMA_C15BRUR_DUV_SHIFT		16
#define MDMA_C15BRUR_DUV_MASK		0xffff
/** @defgroup mdma_c15brur_duv DUV destination address update
@{*/
/**@}*/


#define MDMA_C15BRUR_SUV_SHIFT		0
#define MDMA_C15BRUR_SUV_MASK		0xffff
/** @defgroup mdma_c15brur_suv SUV source adresse update value
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15lar C15LAR MDMA channel x Link Address register
@{*/


#define MDMA_C15LAR_LAR_SHIFT		0
#define MDMA_C15LAR_LAR_MASK		0xffffffff
/** @defgroup mdma_c15lar_lar LAR Link address register
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15tbr C15TBR MDMA channel x Trigger and Bus selection Register
@{*/

/** MDMA_C15TBR_DBUS Destination BUS slect This bit is protected and can be written only if EN is 0. **/
#define MDMA_C15TBR_DBUS		(1 << 17)
/** MDMA_C15TBR_SBUS Source BUS select This bit is protected and can be written only if EN is 0. **/
#define MDMA_C15TBR_SBUS		(1 << 16)

#define MDMA_C15TBR_TSEL_SHIFT		0
#define MDMA_C15TBR_TSEL_MASK		0x3f
/** @defgroup mdma_c15tbr_tsel TSEL Trigger selection
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15mar C15MAR MDMA channel x Mask address register
@{*/


#define MDMA_C15MAR_MAR_SHIFT		0
#define MDMA_C15MAR_MAR_MASK		0xffffffff
/** @defgroup mdma_c15mar_mar MAR Mask address
@{*/
/**@}*/


/**@}*/

/** @defgroup mdma_c15mdr C15MDR MDMA channel x Mask Data register
@{*/


#define MDMA_C15MDR_MDR_SHIFT		0
#define MDMA_C15MDR_MDR_MASK		0xffffffff
/** @defgroup mdma_c15mdr_mdr MDR Mask data
@{*/
/**@}*/


/**@}*/
